; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared0 - mode
	spectrograph2 - mode
	thermograph1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	GroundStation6 - direction
	Star4 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation7)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon16)
)
(:goal (and
	(pointing satellite0 Planet12)
	(have_image Phenomenon8 thermograph1)
	(have_image Star9 spectrograph2)
	(have_image Phenomenon10 infrared0)
	(have_image Star11 thermograph1)
	(have_image Planet12 spectrograph2)
	(have_image Phenomenon13 infrared0)
	(have_image Phenomenon14 infrared0)
	(have_image Star15 spectrograph2)
	(have_image Phenomenon16 thermograph1)
))

)

; plan
1. (turn_to satellite1 groundstation5 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 10
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite1 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon14 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon14)
   goals met: 0 of 10
5. (take_image satellite1 phenomenon14 instrument1 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon13 instrument1 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 2 of 10
8. (turn_to satellite1 phenomenon10 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 10
9. (take_image satellite1 phenomenon10 instrument1 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 3 of 10
10. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 3 of 10
11. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 3 of 10
12. (turn_to satellite0 planet12 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet12)
   goals met: 4 of 10
13. (turn_to satellite1 star4 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star4)
   goals met: 4 of 10
14. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 4 of 10
15. (turn_to satellite1 phenomenon16 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon16)
   goals met: 4 of 10
16. (take_image satellite1 phenomenon16 instrument3 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 5 of 10
17. (turn_to satellite1 phenomenon8 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon8)
   goals met: 5 of 10
18. (take_image satellite1 phenomenon8 instrument3 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 6 of 10
19. (turn_to satellite1 planet12 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet12)
   goals met: 6 of 10
20. (take_image satellite1 planet12 instrument3 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 7 of 10
21. (turn_to satellite1 star11 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star11)
   goals met: 7 of 10
22. (take_image satellite1 star11 instrument3 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 8 of 10
23. (turn_to satellite1 star15 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star15)
   goals met: 8 of 10
24. (take_image satellite1 star15 instrument3 spectrograph2)
   added: (have_image star15 spectrograph2)
   goals met: 9 of 10
25. (turn_to satellite1 star9 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star9)
   goals met: 9 of 10
26. (take_image satellite1 star9 instrument3 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 10 of 10
